Revit 2024 API
MultiplanarOption Enumeration
 Input argument type for Rebar.GetCenterlineCurves method. Controls whether all curves of a multi-planar Rebar element are returned by GetCenterlineCurves, or only the curves in the primary plane.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MultiplanarOption
Visual Basic
Public Enumeration MultiplanarOption
Visual C++
public enum class MultiplanarOption
Members
Member name | Description
IncludeAllMultiplanarCurves |  Include all curves.
IncludeOnlyPlanarCurves |  Include only curves which lie in the Rebar's primary plane.
See Also
Autodesk.Revit.DB.Structure Namespace